extends Node

var sector_cards := {
	1: {
		"topic": "المال العام",
		"background": "المال العام هو الأموال التي تمتلكها الدولة، وتُستخدم لتحسين حياة الناس في المجتمع. مثلًا، تجمع الحكومة المال من المواطنين أو من مصادر أخرى، ثم تنفقه على أشياء مهمة مثل المدارس والمستشفيات والطرق.",
		"questions": [
			{
				"question": "أي من الخيارات التالية يمكنك تحقيق ربح مالي منه إذا كنت شريكًا أو مالكًا فيه؟",
				"answers": {
					"A": "مستشفى رام الله الحكومي",
					"B": "البنك العربي",
					"C": "مدرسة ذكور رام الله الثانوية"
				},
				"correct": "B",
				"correct_index": 1,
				"image": "res://أسئلة القطاعات/بطاقات المال العام/المال العام-02.png",
				"info_image": "res://أسئلة القطاعات/بطاقات المال العام/المال العام-03.png"
			},
			{
				"question": "في أي من الحالات التالية يتم استخدام المال العام؟",
				"answers": {
					"A": "إقراض أموال للمواطنين لبناء منازل",
					"B": "تعبيد الشوارع",
					"C": "بناء منتجعات سياحية"
				},
				"correct": "B",
				"correct_index": 1,
				"image": "res://أسئلة القطاعات/بطاقات المال العام/المال العام-05.png",
				"info_image": "res://أسئلة القطاعات/بطاقات المال العام/المال العام-06.png"
			}
		]
	},

	2: {
		"topic": "الإيرادات العامة",
		"background": "الإيرادات العامة هي الأموال التي تحصل عليها الدولة من مصادر مختلفة مثل الضرائب والرسوم والجمارك، وتدخل في خزينتها العامة.",
		"questions": [
			{
				"question": "أي من الخيارات التالية تُحقق الدولة منها دخلًا رسميًا يدخل في خزينتها العامة؟",
				"answers": {
					"A": "فرض رسوم جمارك على شراء المركبات",
					"B": "التبرعات الخيرية من المواطنين",
					"C": "بيع تذكار مباراة كرة قدم"
				},
				"correct": "A",
				"correct_index": 0,
				"image": "res://أسئلة القطاعات/بطاقات الإيرادات العامة/الإيرادات العامة-02.png",
				"info_image": "res://أسئلة القطاعات/بطاقات الإيرادات العامة/الإيرادات العامة-03.png"
			},
			{
				"question": "دفع صاحب شركة عقارات ضريبة على أرباحه السنوية ورسومًا لتجديد رخصة المحل من البلدية. هذه المبالغ التي حصلت عليها الحكومة تُصنّف ضمن؟",
				"answers": {
					"A": "نفقات تشغيلية",
					"B": "قروض حكومية",
					"C": "إيرادات عامة"
				},
				"correct": "C",
				"correct_index": 2,
				"image": "res://أسئلة القطاعات/بطاقات الإيرادات العامة/الإيرادات العامة-05.png",
				"info_image": "res://أسئلة القطاعات/بطاقات الإيرادات العامة/الإيرادات العامة-06.png"
			}
		]
	},

	3: {
		"topic": "النفقات",
		"background": "النفقات هي كل ما تنفقه الدولة بشكل دوري لتسيير أعمالها وضمان تقديم الخدمات العامة للمواطنين.",
		"questions": [
			{
				"question": "أي من هذه الأنشطة تمثل إنفاقًا ضروريًا للحكومة للحفاظ على استمرارية سير عملها؟",
				"answers": {
					"A": "شراء لوحات فنية لتزيين المكاتب الحكومية",
					"B": "دفع رواتب الموظفين الحكوميين",
					"C": "حجز فنادق للوفود الأجنبية"
				},
				"correct": "B",
				"correct_index": 1,
				"image": "res://أسئلة القطاعات/بطاقات النفقات/النفقات-02.png",
				"info_image": "res://أسئلة القطاعات/بطاقات النفقات/النفقات-03.png"
			},
			{
				"question": "خصصت الحكومة الفلسطينية ميزانية لصيانة الطرق وإنشاء شبكة صرف صحي في إحدى البلدات. هذا يُعد مثالًا على؟",
				"answers": {
					"A": "إنفاق حكومي ضروري على المواطنين",
					"B": "إيراد من البلديات",
					"C": "إنفاق حكومي ضروري لتسيير أعمالها"
				},
				"correct": "A",
				"correct_index": 0,
				"image": "res://أسئلة القطاعات/بطاقات النفقات/النفقات-05.png",
				"info_image": "res://أسئلة القطاعات/بطاقات النفقات/النفقات-06.png"
			}
		]
	},

	4: {
		"topic": "عجز / فائض",
		"background": "يحدث فائض في الميزانية عندما تكون الإيرادات التي تحصل عليها الحكومة أكبر من النفقات التي تقوم بصرفها، أما عندما يصبح الإنفاق الحكومي أكبر من الإيرادات يحصل عجز في الميزانية.",
		"questions": [
			{
				"question": "بلغت إيرادات الدولة لعام 2024 مقدار 14 مليار شيكل، بينما بلغت نفقاتها 17.9 مليار شيكل. يعتبر هذا؟",
				"answers": {
					"A": "استثمار ناجح",
					"B": "فائض مالي",
					"C": "عجز مالي"
				},
				"correct": "C",
				"correct_index": 2,
				"image": "res://أسئلة القطاعات/بطاقات عجز/بطاقات عجز-02.png",
				"info_image": "res://أسئلة القطاعات/بطاقات عجز/بطاقات عجز-03.png"
			},
			{
				"question": "في نهاية السنة، تبين أن الدولة جمعت من الضرائب والرسوم أكثر مما أنفقت على المشاريع والخدمات العامة. هذا يطلق عليه مصطلح؟",
				"answers": {
					"A": "دين عام",
					"B": "فائض مالي",
					"C": "عجز تجاري"
				},
				"correct": "B",
				"correct_index": 1,
				"image": "res://أسئلة القطاعات/بطاقات عجز/بطاقات عجز-05.png",
				"info_image": "res://أسئلة القطاعات/بطاقات عجز/بطاقات عجز-06.png"
			}
		]
	},

	5: {
		"topic": "التخطيط المالي",
		"background": "التخطيط المالي هو رسم خارطة طريق لإدارة الأموال العامة بطريقة منظمة تساعد على تحقيق الاستقرار المالي.",
		"questions": [
			{
				"question": "ما هو تعريف التخطيط المالي؟",
				"answers": {
					"A": "رسم خارطة طريق لإدارة الأموال العامة بطريقة منظمة تساعد على تحقيق الاستقرار المالي",
					"B": "خطة لإدارة الإيرادات الضريبية فقط",
					"C": "خطة للاستثمارات التي ستقوم بها الدولة في المستقبل فقط"
				},
				"correct": "A",
				"correct_index": 0,
				"image": "res://أسئلة القطاعات/التخطيط المالي/التخطيط المالي-02.png",
				"info_image": "res://أسئلة القطاعات/التخطيط المالي/التخطيط المالي-03.png"
			},
			{
				"question": "ما هي أهداف التخطيط المالي؟",
				"answers": {
					"A": "تحقيق التوازن والاستقرار المالي",
					"B": "تحقيق أهداف اقتصادية وتنموية",
					"C": "تحقيق أرباح من خلال الاستثمارات فقط"
				},
				"correct": "A",
				"correct_index": 0,
				"image": "res://أسئلة القطاعات/التخطيط المالي/التخطيط المالي-05.png",
				"info_image": "res://أسئلة القطاعات/التخطيط المالي/التخطيط المالي-06.png"
			}
		]
	},

	6: {
		"topic": "الموازنة العامة",
		"background": "تعتبر وزارة المالية هي المسؤولة عن إعداد وإدارة الموازنة العامة، بالتنسيق مع باقي الوزارات والمؤسسات الحكومية.",
		"questions": [
			{
				"question": "________ هي خطة مالية لسنة مالية قادمة تحدد الحكومة فيها الإيرادات المتوقعة والنفقات المخطط لها.",
				"answers": {
					"A": "القانون المالي",
					"B": "الخطة السياساتية",
					"C": "الموازنة العامة"
				},
				"correct": "C",
				"correct_index": 2,
				"image": "res://أسئلة القطاعات/بطاقات الموازنة العامة/الموازنة العامة-02.png",
				"info_image": "res://أسئلة القطاعات/بطاقات الموازنة العامة/الموازنة العامة-03.png"
			},
			{
				"question": "أي من الآتي يعكس أولويات الحكومة ورؤيتها للتنمية في فلسطين؟",
				"answers": {
					"A": "الموازنة العامة",
					"B": "قائمة مشتريات اللوازم",
					"C": "تعديلات في قانون الضرائب الفلسطيني"
				},
				"correct": "A",
				"correct_index": 0,
				"image": "res://أسئلة القطاعات/بطاقات الموازنة العامة/الموازنة العامة-05.png",
				"info_image": "res://أسئلة القطاعات/بطاقات الموازنة العامة/الموازنة العامة-06.png"
			}
		]
	},

	7: {
		"topic": "الرسوم",
		"background": "الرسوم هي مبلغ صغير يدفعه الشخص مقابل خدمة محددة يحصل عليها من الدولة؛ مثل إصدار الهويات وجوازات السفر وتسجيل الأراضي والعقارات.",
		"questions": [
			{
				"question": "في بداية الفصل الدراسي تقوم بدفع مبلغ بسيط من المال لمدرستك. يطلق على هذا المبلغ مصطلح؟",
				"answers": {
					"A": "تبرعات",
					"B": "ضريبة مدرسية",
					"C": "رسوم"
				},
				"correct": "C",
				"correct_index": 2,
				"image": "res://أسئلة القطاعات/بطاقات الرسوم/الرسوم-02.png",
				"info_image": "res://أسئلة القطاعات/بطاقات الرسوم/الرسوم-03.png"
			},
			{
				"question": "يدفع خالد مبلغًا سنويًا لوزارة النقل والمواصلات من أجل تجديد ترخيص سيارته. هذا المبلغ يُسمى؟",
				"answers": {
					"A": "ضريبة ملكية",
					"B": "رسم ترخيص",
					"C": "تأمين إجباري"
				},
				"correct": "B",
				"correct_index": 1,
				"image": "res://أسئلة القطاعات/بطاقات الرسوم/الرسوم-05.png",
				"info_image": "res://أسئلة القطاعات/بطاقات الرسوم/الرسوم-06.png"
			}
		]
	},

	8: {
		"topic": "الدين العام",
		"background": "يطلق على المبالغ المالية التي تقترضها الحكومة من مصادر داخلية أو خارجية لتمويل عجز موازنتها أو تمويل مشاريع تنموية مصطلح الدين العام.",
		"questions": [
			{
				"question": "قامت السلطة الفلسطينية بالحصول على قرض من أحد البنوك المحلية لتغطية رواتب الموظفين في ظل تراجع الإيرادات. هذا التصرف يدخل ضمن؟",
				"answers": {
					"A": "التهرب الضريبي",
					"B": "الدين العام",
					"C": "الاحتياط النقدي"
				},
				"correct": "B",
				"correct_index": 1,
				"image": "res://أسئلة القطاعات/بطاقات الدين العام/الدين العام-02.png",
				"info_image": "res://أسئلة القطاعات/بطاقات الدين العام/الدين العام-03.png"
			},
			{
				"question": "وقّعت الحكومة الفلسطينية اتفاقًا مع دولة صديقة لتمويل إنشاء محطة طاقة، على أن يتم سداد المبلغ لاحقًا على دفعات. هذا يُعتبر؟",
				"answers": {
					"A": "منح دولية",
					"B": "مساعدات إنسانية",
					"C": "دين عام"
				},
				"correct": "C",
				"correct_index": 2,
				"image": "res://أسئلة القطاعات/بطاقات الدين العام/الدين العام-05.png",
				"info_image": "res://أسئلة القطاعات/بطاقات الدين العام/الدين العام-06.png"
			}
		]
	},

	9: {
		"topic": "الرقابة المالية",
		"background": "الرقابة المالية هي عملية متابعة وتقييم الأداء المالي للحكومة بهدف ضمان استخدام الأموال العامة بشكل قانوني وفعّال.",
		"questions": [
			{
				"question": "بعد تنفيذ مشروع لصيانة الشوارع، قامت هيئة حكومية بمراجعة كيفية صرف الأموال والتأكد من أنها استخدمت حسب الخطة. هذا العمل يُسمى؟",
				"answers": {
					"A": "توزيع موازنات",
					"B": "الرقابة المالية",
					"C": "تقارير إنجاز"
				},
				"correct": "B",
				"correct_index": 1,
				"image": "res://أسئلة القطاعات/بطاقات الرقابة المالية/الرقابة المالية-02.png",
				"info_image": "res://أسئلة القطاعات/بطاقات الرقابة المالية/الرقابة المالية-03.png"
			},
			{
				"question": "أثناء تجهيز مستشفى حكومي، قامت وزارة المالية بمراجعة أوامر الصرف والتأكد من أن كل دفعة صُرفت حسب الأصول. هذا النوع من المتابعة يُسمى؟",
				"answers": {
					"A": "تخطيط مالي",
					"B": "رقابة مالية",
					"C": "تحويلات بنكية"
				},
				"correct": "B",
				"correct_index": 1,
				"image": "res://أسئلة القطاعات/بطاقات الرقابة المالية/الرقابة المالية-05.png",
				"info_image": "res://أسئلة القطاعات/بطاقات الرقابة المالية/الرقابة المالية-06.png"
			}
		]
	},

	10: {
		"topic": "الشفافية المالية",
		"background": "الشفافية تعني إتاحة المعلومات بشكل واضح ودقيق للمواطنين والمجتمع لضمان المساءلة وتوفير فرص للمراجعة والمراقبة.",
		"questions": [
			{
				"question": "نشرت وزارة المالية تقريرًا علنيًا يوضح أين صُرفت أموال الموازنة خلال العام، وتم توفيره على الموقع الإلكتروني. هذا الإجراء يُعبر عن؟",
				"answers": {
					"A": "الشفافية",
					"B": "الدعاية الحكومية",
					"C": "الرقابة الخارجية"
				},
				"correct": "A",
				"correct_index": 0,
				"image": "res://أسئلة القطاعات/بطاقات الشفافية المالية/الشفافية المالية-02.png",
				"info_image": "res://أسئلة القطاعات/بطاقات الشفافية المالية/الشفافية المالية-03.png"
			},
			{
				"question": "أعلنت وزارة الصحة عن قيمة الأدوية التي تم شراؤها وتوزيعها على المستشفيات، وذكرت الأرقام والتكاليف في بيان رسمي. هذا السلوك يُظهر؟",
				"answers": {
					"A": "التنافس التجاري",
					"B": "الشفافية",
					"C": "الخصوصية المؤسسية"
				},
				"correct": "B",
				"correct_index": 1,
				"image": "res://أسئلة القطاعات/بطاقات الشفافية المالية/الشفافية المالية-05.png",
				"info_image": "res://أسئلة القطاعات/بطاقات الشفافية المالية/الشفافية المالية-06.png"
			}
		]
	},

	11: {
		"topic": "المساءلة المالية",
		"background": "تساعد المساءلة المالية على ضمان استخدام الأموال العامة بكفاءة وفعالية، كما تعزز الثقة بين الحكومة والمواطنين وتقلل من فرص الفساد.",
		"questions": [
			{
				"question": "أُجبرت مؤسسة حكومية على توضيح كيف صرفت أموال منحة دولية بعد وجود نقص في المستندات، وتم استدعاؤها من جهة رقابية. هذه الحالة مثال على؟",
				"answers": {
					"A": "الشفافية المؤسسية",
					"B": "المساءلة المالية",
					"C": "تحقيق صحفي"
				},
				"correct": "B",
				"correct_index": 1,
				"image": "res://أسئلة القطاعات/بطاقات المساءلة المالية/المساءلة المالية-02.png",
				"info_image": "res://أسئلة القطاعات/بطاقات المساءلة المالية/المساءلة المالية-03.png"
			},
			{
				"question": "نظم مواطنون اجتماعًا مع مسؤولين محليين وطرحوا أسئلة عن تأخير إصلاح شبكات المياه وطلبوا شرحًا حول الميزانية. هذا النوع من المشاركة يُسمى؟",
				"answers": {
					"A": "مساءلة مجتمعية",
					"B": "إدارة محلية",
					"C": "تنظيم اجتماعات عامة"
				},
				"correct": "A",
				"correct_index": 0,
				"image": "res://أسئلة القطاعات/بطاقات المساءلة المالية/المساءلة المالية-05.png",
				"info_image": "res://أسئلة القطاعات/بطاقات المساءلة المالية/المساءلة المالية-06.png"
			}
		]
	},

	12: {
		"topic": "الاقتصاد الكلي والجزئي",
		"background": "الاقتصاد الكلي يدرس اقتصاد الدولة ككل، بينما الاقتصاد الجزئي يدرس سلوك الأفراد والأسواق والقرارات الاقتصادية الصغيرة.",
		"questions": [
			{
				"question": "ما هو المفهوم الأكبر: الاقتصاد الكلي أم الجزئي؟",
				"answers": {
					"A": "الاقتصاد الكلي",
					"B": "الاقتصاد الجزئي",
					"C": "لا شيء مما ذكر"
				},
				"correct": "A",
				"correct_index": 0,
				"image": "res://أسئلة القطاعات/التخطيط الكلي والجزئي/التخطيط الكلي والجزئي-02.png",
				"info_image": "res://أسئلة القطاعات/التخطيط الكلي والجزئي/التخطيط الكلي والجزئي-03.png"
			},
			{
				"question": "ما هو الفرق الأساسي بين الاقتصاد الكلي والجزئي؟",
				"answers": {
					"A": "الاقتصاد الكلي يدرس اقتصاد الدولة ككل",
					"B": "الاقتصاد الجزئي يدرس اقتصاد الدولة ككل",
					"C": "الاقتصاد الجزئي يعمل على تحسين الخدمات الحكومية فقط"
				},
				"correct": "A",
				"correct_index": 0,
				"image": "res://أسئلة القطاعات/التخطيط الكلي والجزئي/التخطيط الكلي والجزئي-05.png",
				"info_image": "res://أسئلة القطاعات/التخطيط الكلي والجزئي/التخطيط الكلي والجزئي-06.png"
			}
		]
	},

	13: {
		"topic": "الضرائب",
		"background": "الضرائب هي مبالغ مالية تفرضها الحكومة على الأفراد والشركات لتمويل النفقات العامة والخدمات الحكومية.",
		"questions": [
			{
				"question": "يعمل أحمد موظفًا ويتلقى راتبًا شهريًا، لكن يتم خصم جزء من راتبه بشكل إجباري ويذهب لخزينة الدولة. يطلق على المبلغ المقتطع؟",
				"answers": {
					"A": "اشتراك تأمين",
					"B": "ضريبة دخل",
					"C": "تبرعات من الموظفين للدولة"
				},
				"correct": "B",
				"correct_index": 1,
				"image": "res://أسئلة القطاعات/بطاقات الضرائب/الضرائب-02.png",
				"info_image": "res://أسئلة القطاعات/بطاقات الضرائب/الضرائب-03.png"
			},
			{
				"question": "اشترت ليان هاتفًا ولاحظت أن الفاتورة تتضمن مبلغًا إضافيًا بنسبة 16% من السعر الأصلي. هذا المبلغ الإضافي يُسمى؟",
				"answers": {
					"A": "خصم تجاري",
					"B": "ضريبة قيمة مضافة",
					"C": "رسوم صيانة"
				},
				"correct": "B",
				"correct_index": 1,
				"image": "res://أسئلة القطاعات/بطاقات الضرائب/الضرائب-05.png",
				"info_image": "res://أسئلة القطاعات/بطاقات الضرائب/الضرائب-06.png"
			}
		]
	},

	14: {
		"topic": "التهرب الضريبي",
		"background": "التهرب الضريبي هو محاولة الأفراد أو الشركات التهرب من دفع الضرائب المقررة عليهم من خلال إخفاء الإيرادات أو تقديم معلومات غير صحيحة.",
		"questions": [
			{
				"question": "صاحب محل إلكترونيات لا يُسجّل كل مبيعاته في الفواتير الرسمية ليُظهر أرباحًا أقل عند تقديم بياناته للدوائر الضريبية. هذا التصرف يُعد؟",
				"answers": {
					"A": "حسن إدارة للمبيعات",
					"B": "تهرب ضريبي",
					"C": "خصم تجاري"
				},
				"correct": "B",
				"correct_index": 1,
				"image": "res://أسئلة القطاعات/بطاقات التهرب الضريبي/التهرب الضريبي-02.png",
				"info_image": "res://أسئلة القطاعات/بطاقات التهرب الضريبي/التهرب الضريبي-03.png"
			},
			{
				"question": "مدرسة خاصة سجّلت بعض موظفيها بأجور أقل مما يتقاضونه فعليًا لتقليل الالتزامات المترتبة على الرواتب. هذا التصرف هو؟",
				"answers": {
					"A": "تهرب ضريبي",
					"B": "تنظيم موارد بشرية",
					"C": "تحسين الرواتب"
				},
				"correct": "A",
				"correct_index": 0,
				"image": "res://أسئلة القطاعات/بطاقات التهرب الضريبي/التهرب الضريبي-05.png",
				"info_image": "res://أسئلة القطاعات/بطاقات التهرب الضريبي/التهرب الضريبي-06.png"
			}
		]
	}
}
